test/moveDynamicMesh/modified/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-14.7 -7.825 -3)
    (14.7 -7.825 -3)
    (14.7 7.825 -3)
    (-14.7 7.825 -3) 
    (-14.7 -7.825 2)
    (14.7 -7.825 2)
    (14.7 7.825 2)
    (-14.7 7.825 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (128 64 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
	    // (0 3 2 1)
	    // (3 7 6 2)

        );
    }
 backWall
    {
        type wall;
        faces
        (
	 //(1 5 4 0)
	 // (0 3 2 1)
            (3 7 6 2)

        );
    }
 bottom
    {
        type wall;
        faces
        (
	 //(1 5 4 0)
	    (0 3 2 1)
            //(3 7 6 2)

        );
    }


    inlet
    {
	type patch;
        faces
	(
            (0 4 7 3)
	);
    }

    outlet
    {
	type patch;
        faces
	(
            (2 6 5 1)
	);
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
